Structural Connection cannot replace elements
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId StructuralConnectionCannotReplaceRefs { get; }
  Visual Basic
Public Shared ReadOnly Property StructuralConnectionCannotReplaceRefs As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionCannotReplaceRefs {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StructuralConnectionFailures Class
  Autodesk.Revit.DB Namespace